# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете
# необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета для конкретных
# значений необходимо запускать скрипт с параметрами.

from sys import argv
from mylib import payroll_calculation

script, name, hours, rate = argv

result = payroll_calculation(hours, rate)
print(f'Employee {name} earned {result}')